01  WS-AREA-1 PIC 9(5) VALUE ZEROES.
01  WS-AREA-2 PIC 9(5) VALUE ZEROES.
01  WS-OVERFLOW-FLAG PIC 9 VALUE 0.

PROCEDURE DIVISION.

    ADD 1 TO WS-AREA-1.
    IF WS-AREA-1 > 99999 THEN
        MOVE 1 TO WS-OVERFLOW-FLAG
        DISPLAY "Arithmetic Overflow!" 
    ELSE
        ADD WS-AREA-1 TO WS-AREA-2
        DISPLAY WS-AREA-2
    END-IF
    STOP RUN.